Documents/Сторнирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Сторнирование</Name>
			<BasedOn>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.АктОбОказанииПроизводственныхУслуг</xr:Item>
				<xr:Item>Document.ВводНачальныхОстатковОС</xr:Item>
				<xr:Item>Document.ВводНачальныхОстатковПоЗарплате</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.ВыработкаНМА</xr:Item>
				<xr:Item>Document.ВыработкаОС</xr:Item>
				<xr:Item>Document.ГТДИмпорт</xr:Item>
				<xr:Item>Document.ДвижениеНЗП</xr:Item>
				<xr:Item>Document.ДепонированиеЗаработнойПлаты</xr:Item>
				<xr:Item>Document.ЗакрытиеДтКтЗадолженности</xr:Item>
				<xr:Item>Document.ЗакрытиеМесяца</xr:Item>
				<xr:Item>Document.КомплектацияНоменклатуры</xr:Item>
				<xr:Item>Document.КорректировкаДолга</xr:Item>
				<xr:Item>Document.МодернизацияОС</xr:Item>
				<xr:Item>Document.НачислениеЗарплатыРаботникамОрганизаций</xr:Item>
				<xr:Item>Document.ОперацияБух</xr:Item>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ОтражениеЗарплатыВРеглУчете</xr:Item>
				<xr:Item>Document.ОтчетПроизводстваЗаСмену</xr:Item>
				<xr:Item>Document.ПередачаНМА</xr:Item>
				<xr:Item>Document.ПередачаОС</xr:Item>
				<xr:Item>Document.ПередачаТоваров</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ПереоценкаВнеоборотныхАктивов</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеВходящее</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеИсходящее</xr:Item>
				<xr:Item>Document.ПлатежныйОрдерПоступлениеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПлатежныйОрдерСписаниеДенежныхСредств</xr:Item>
				<xr:Item>Document.ПоступлениеДопРасходов</xr:Item>
				<xr:Item>Document.ПоступлениеИзПереработки</xr:Item>
				<xr:Item>Document.ПоступлениеНМА</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПринятиеКУчетуОС</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасчетНалоговПриПоступленииАктивовУслуг</xr:Item>
				<xr:Item>Document.РасчетПениОПВиСО</xr:Item>
				<xr:Item>Document.РасчетСНиСО</xr:Item>
				<xr:Item>Document.РасчетУдержанийРаботниковОрганизаций</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.РеализацияУслугПоПереработке</xr:Item>
				<xr:Item>Document.РегистрацияПрочихДоходовВЦеляхНалогообложения</xr:Item>
				<xr:Item>Document.РегистрацияРазовыхУдержанийРаботниковОрганизаций</xr:Item>
				<xr:Item>Document.СписаниеНМА</xr:Item>
				<xr:Item>Document.СписаниеОС</xr:Item>
				<xr:Item>Document.СписаниеТоваров</xr:Item>
				<xr:Item>Document.Сторнирование</xr:Item>
				<xr:Item>Document.ТребованиеНакладная</xr:Item>
				<xr:Item>Document.УдержаниеИПНиОПВНУ</xr:Item>
				<xr:Item>Document.РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС</xr:Item>
				<xr:Item>Document.РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС</xr:Item>
				<xr:Item>Document.КорректировкаСтоимостиСписанияТоваров</xr:Item>
				<xr:Item>Document.СчетФактураВыданный</xr:Item>
				<xr:Item>Document.СчетФактураПолученный</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СведенияСчетовФактурПолученных</xr:Item>
				<xr:Item>AccumulationRegister.ОПВПодлежитПеречислениюВФонды</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыОрганизацийСКонтрагентамиФизЛицами</xr:Item>
				<xr:Item>AccumulationRegister.НДССИзмененнымСрокомУплаты</xr:Item>
				<xr:Item>AccumulationRegister.СведенияСчетовФактурВыданных</xr:Item>
				<xr:Item>AccumulationRegister.Акциз</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаСчетов</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСДепонентамиОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВыпускПродукцииУслугБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.РеализацияТМЗ</xr:Item>
				<xr:Item>AccumulationRegister.ОППВРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМСПодлежитПеречислениюВФонды</xr:Item>
				<xr:Item>AccumulationRegister.ЕПКомпоненты</xr:Item>
				<xr:Item>AccumulationRegister.ВыплаченныеДоходыРаботникамОрганизацийНУ</xr:Item>
				<xr:Item>AccumulationRegister.ИПНСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ЕПРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизацийБУ</xr:Item>
				<xr:Item>AccumulationRegister.СНСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.НДСВзаиморасчетыСБюджетом</xr:Item>
				<xr:Item>AccumulationRegister.ЕПСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМСРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.ОПВРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкаНДС</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаНМА</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМССведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ПереоценкаВнеоборотныхАктивов</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.ООСМССведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.СОСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ВыпускПродукцииУслугНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОПВРСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ИПНРасчетыСБюджетом</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
				<xr:Item>AccumulationRegister.НДСКВозмещению</xr:Item>
				<xr:Item>AccumulationRegister.ООСМСРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.СведенияОбИсчисленииВычетовИПН</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыОрганизацийСПолучателямиИЛ</xr:Item>
				<xr:Item>AccumulationRegister.ОПВСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ОППВСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ОПВРРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоПрочимВыплатам</xr:Item>
				<xr:Item>AccumulationRegister.СОРасчетыСФондами</xr:Item>
				<xr:Item>AccumulationRegister.СНИсчисленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаНерезидента</xr:Item>
				<xr:Item>AccumulationRegister.НДС</xr:Item>
				<xr:Item>AccumulationRegister.ВыработкаОС</xr:Item>
				<xr:Item>AccumulationRegister.КорректировкаНДСКВозмещению</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НачислениеЗарплатыРаботникамОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НачислениеЗарплатыРаботникамОрганизаций</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПериодыОплатыДляМедицинскогоСтрахования</xr:Item>
				<xr:Item>AccumulationRegister.ИПНСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.СНСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ЕПСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСРаботникамиОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВОСМССведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ООСМССведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.СОСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ОПВРСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ОПВСведенияОДоходах</xr:Item>
				<xr:Item>AccumulationRegister.ОППВСведенияОДоходах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставВидовРасчетаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Физлицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияВБухучете</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеДанные</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Сторнирование/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура") 
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		Документы.Сторнирование.ЗаполнитьПоДокументуОснования(ЭтотОбъект, ДанныеЗаполнения);
		Возврат;
	ИначеЕсли ТипДанныхЗаполнения = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("Автор") Тогда
			ДанныеЗаполнения.Удалить("Автор");
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Документы.Сторнирование.ОбновитьПериодЗаписейДвижений(ЭтотОбъект);
	
	Если Не ЭтоНовый() И Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
		УстановитьАктивностьДвижений(НЕ ПометкаУдаления);
	ИначеЕсли ПометкаУдаления Тогда
		УстановитьАктивностьДвижений(Ложь);
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ДокументОснованияДоЗаписи",Ссылка.ДокументОснование);
	
	УчетНДСИАкциза.СинхронизацияПометкиНаУдалениеУСчетаФактуры(ЭтотОбъект, "СчетФактураПолученный", Отказ);
	УчетНДСИАкциза.СинхронизацияПометкиНаУдалениеУСчетаФактуры(ЭтотОбъект, "СчетФактураВыданный", Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//синхронизируем данные счет-фактуры и документа основания
	УчетНДСИАкциза.СинхронизироватьДанныеДокументаИСчетаФактуры(ЭтотОбъект, Отказ, "СчетФактураПолученный"); 		
	
	//синхронизируем данные счет-фактуры и документа основания
	УчетНДСИАкциза.СинхронизироватьДанныеДокументаИСчетаФактуры(ЭтотОбъект, Отказ, "СчетФактураВыданный");
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураВыданный")
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		ОснованиеОбъект = ДокументОснование.ПолучитьОбъект();
		Если ОснованиеОбъект <> Неопределено И ОснованиеОбъект.ВидСчетаФактуры = Перечисления.ВидыСчетовФактур.Исправленный Тогда
			Если ПометкаУдаления Тогда
				Документы[ОснованиеОбъект.Метаданные().Имя].ДобавитьДвиженияПоСчетамФактурамПрекратившимДействие(ОснованиеОбъект, Новый Массив());
				ОснованиеОбъект.Движения.СчетаФактурыПрекратившиеДействие.Записать();
			Иначе
				ОснованиеОбъект.Движения.СчетаФактурыПрекратившиеДействие.Очистить();
				ОснованиеОбъект.Движения.СчетаФактурыПрекратившиеДействие.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;        
			
	ОчиститьДозаписатьПериодыОплатыДляМедицинскогоСтрахования(Отказ); 
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Документ не записан ...'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура УстановитьАктивностьДвижений(ФлагАктивности)
	
	Для Каждого Движение Из Движения Цикл
		
		Движение.Прочитать();
		Движение.УстановитьАктивность(ФлагАктивности);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьДозаписатьПериодыОплатыДляМедицинскогоСтрахования(Отказ); 
	    
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.НачислениеЗарплатыРаботникамОрганизаций")  Тогда
		ИспользуетсяПериодДействия = НЕ УчетнаяПолитикаСервер.ОтражениеПоПериодуРегистрации(Организация, НачалоМесяца(ДокументОснование.ПериодРегистрации));
	
		Если НЕ ИспользуетсяПериодДействия
			И НачалоМесяца(ДокументОснование.ПериодРегистрации) >= РасчетЗарплатыСервер.ДатаИзмененияПорядкаПеречисленияОСМС2024() Тогда
							
			ОснованиеОбъект = ДокументОснование.ПолучитьОбъект();
			
			Если ОснованиеОбъект <> Неопределено  Тогда				
				Если ПометкаУдаления Тогда                                          
										
					//нужно восстановить движения по периодам отпусков   
					ПараметрыПроведенияОснования = Документы.НачислениеЗарплатыРаботникамОрганизаций.ПодготовитьПараметрыПроведения(ДокументОснование, Отказ);
					
					ТаблицаПериодыОплатыДляМедицинскогоСтрахования = РасчетЗарплатыСервер.ПодготовитьТаблицуПериодыОплатыДляМедицинскогоСтрахования(ПараметрыПроведенияОснования.Реквизиты[0], 
												ПараметрыПроведенияОснования.Начисления, 
												ОснованиеОбъект.Движения.ПериодыОплатыДляМедицинскогоСтрахования.ВыгрузитьКолонки(),
												Отказ);											
												
					ОснованиеОбъект.Движения.ПериодыОплатыДляМедицинскогоСтрахования.Загрузить(ТаблицаПериодыОплатыДляМедицинскогоСтрахования);   
									
				Иначе  
					//очистим движения
					ОснованиеОбъект.Движения.ПериодыОплатыДляМедицинскогоСтрахования.Очистить();					
				КонецЕсли;                                                                      
				
				Если Не Отказ Тогда
					ОснованиеОбъект.Движения.ПериодыОплатыДляМедицинскогоСтрахования.Записать(); 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 	   
	КонецЕсли;
	
	ДокументОснованиеДоЗаписи = Неопределено; 
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ДокументОснованияДоЗаписи",ДокументОснованиеДоЗаписи) Тогда
	
		Если ДокументОснованиеДоЗаписи = Неопределено Тогда
			Возврат;                                           
		КонецЕсли;
			
		//проверим, если в документе был изменен сторнирующий документ, то нужно восстановить запсиси в регистре по периодам, если они там были
		ИзмененДокументОснованиеНачисления = (ДокументОснование <> ДокументОснованиеДоЗаписи И ТипЗнч(ДокументОснованиеДоЗаписи) = Тип("ДокументСсылка.НачислениеЗарплатыРаботникамОрганизаций")); 
		
		Если НЕ ИзмененДокументОснованиеНачисления Тогда
			Возврат;	
		КонецЕсли;
		
		ИспользуетсяПериодДействия = НЕ УчетнаяПолитикаСервер.ОтражениеПоПериодуРегистрации(Организация, НачалоМесяца(ДокументОснованиеДоЗаписи.ПериодРегистрации)); 
		
		Если  ИспользуетсяПериодДействия
			ИЛИ НачалоМесяца(ДокументОснованиеДоЗаписи.ПериодРегистрации) < РасчетЗарплатыСервер.ДатаИзмененияПорядкаПеречисленияОСМС2024() Тогда
			Возврат;
		КонецЕсли;     
		
		ОснованиеОбъектДоЗаписи = ДокументОснованиеДоЗаписи.ПолучитьОбъект();
		
		Если ИзмененДокументОснованиеНачисления И ОснованиеОбъектДоЗаписи <> Неопределено Тогда   
			//нужно восстановить движения по периодам отпусков   
			ПараметрыПроведенияОснования = Документы.НачислениеЗарплатыРаботникамОрганизаций.ПодготовитьПараметрыПроведения(ДокументОснованиеДоЗаписи, Отказ);
			
			ТаблицаПериодыОплатыДляМедицинскогоСтрахования = РасчетЗарплатыСервер.ПодготовитьТаблицуПериодыОплатыДляМедицинскогоСтрахования(ПараметрыПроведенияОснования.Реквизиты[0], 
			ПараметрыПроведенияОснования.Начисления, 
			ОснованиеОбъектДоЗаписи.Движения.ПериодыОплатыДляМедицинскогоСтрахования.ВыгрузитьКолонки(),
			Отказ);											
			
			ОснованиеОбъектДоЗаписи.Движения.ПериодыОплатыДляМедицинскогоСтрахования.Загрузить(ТаблицаПериодыОплатыДляМедицинскогоСтрахования);  
			
			Если Не Отказ Тогда
				ОснованиеОбъектДоЗаписи.Движения.ПериодыОплатыДляМедицинскогоСтрахования.Записать(); 
			КонецЕсли;  			
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры
#КонецЕсли
